zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_ddr.c
/**
  ******************************************************************************
  * @file    stm32mp13xx_hal_ddr.c
  * @author  MCD Application Team
  * @brief   DDR HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Double Data Rate Synchronous Dynamic Random
  *          Access Memory (DDR-SDRAM) Peripheral, through its controller
  *          (DDRCTRL) and its physical interface controller (DDRPHYC).
  *           +
  *           +
  *           +
  *
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
 ===============================================================================
                        ##### How to use this driver #####
 ===============================================================================

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx_hal.h"

#ifdef HAL_DDR_MODULE_ENABLED

#include <stdbool.h>
#include <string.h>

#if defined DDR_TYPE_DDR3_4Gb
#include "stm32mp13xx-ddr3-4Gb.h"
#elif defined DDR_TYPE_DDR3_8Gb
#include "stm32mp13xx-ddr3-8Gb.h"
#elif defined DDR_TYPE_LPDDR2_4Gb
#include "stm32mp13xx-lpddr2-4Gb.h"
#elif defined DDR_TYPE_LPDDR3_4Gb
#include "stm32mp13xx-lpddr3-4Gb.h"
#else /* DDR_TYPE_DDR3_4Gb */
#error "no DDR settings defined."
#error "Please make sure that DDR_TYPE is set within those values:"
#error "  DDR_TYPE_DDR3_4Gb"
#error "  DDR_TYPE_DDR3_8Gb"
#error "  DDR_TYPE_LPDDR2_4Gb"
#error "  DDR_TYPE_LPDDR3_4Gb"
#error "Please refer to your HW platform capabilities."
#endif  /* DDR_TYPE_DDR3_4Gb */

/** @addtogroup STM32MP13xx_HAL_Driver
  * @{
  */

/** @defgroup DDR DDR
  * @brief HAL DDR module driver
  * @{
  */
#if defined (DDRCTRL) && defined (DDRPHYC)

/* Private typedef -----------------------------------------------------------*/

typedef struct
{
  uint16_t offset; /* Offset for base address */
  uint8_t par_offset; /* Offset for parameter array */
} reg_desc_t;

typedef enum
{
  BASE_DDRCTRL,
  BASE_DDRPHYC,
  BASE_NONE
} base_type;

typedef struct
{
  const char *name;
  const reg_desc_t *desc;
  uint8_t size;
  base_type base;
} ddr_reg_info_t;

typedef enum
{
  REG_REG,
  REG_TIMING,
  REG_PERF,
  REG_MAP,
  REGPHY_REG,
  REGPHY_TIMING,
  REG_TYPE_NB
} reg_type;

typedef struct
{
  uint32_t MSTR;
  uint32_t MRCTRL0;
  uint32_t MRCTRL1;
  uint32_t DERATEEN;
  uint32_t DERATEINT;
  uint32_t PWRCTL;
  uint32_t PWRTMG;
  uint32_t HWLPCTL;
  uint32_t RFSHCTL0;
  uint32_t RFSHCTL3;
  uint32_t CRCPARCTL0;
  uint32_t ZQCTL0;
  uint32_t DFITMG0;
  uint32_t DFITMG1;
  uint32_t DFILPCFG0;
  uint32_t DFIUPD0;
  uint32_t DFIUPD1;
  uint32_t DFIUPD2;
  uint32_t DFIPHYMSTR;
  uint32_t ODTMAP;
  uint32_t DBG0;
  uint32_t DBG1;
  uint32_t DBGCMD;
  uint32_t POISONCFG;
  uint32_t PCCFG;
} HAL_DDR_RegTypeDef;

typedef struct
{
  uint32_t RFSHTMG;
  uint32_t DRAMTMG0;
  uint32_t DRAMTMG1;
  uint32_t DRAMTMG2;
  uint32_t DRAMTMG3;
  uint32_t DRAMTMG4;
  uint32_t DRAMTMG5;
  uint32_t DRAMTMG6;
  uint32_t DRAMTMG7;
  uint32_t DRAMTMG8;
  uint32_t DRAMTMG14;
  uint32_t ODTCFG;
} HAL_DDR_TimingTypeDef;

typedef struct
{
  uint32_t ADDRMAP1;
  uint32_t ADDRMAP2;
  uint32_t ADDRMAP3;
  uint32_t ADDRMAP4;
  uint32_t ADDRMAP5;
  uint32_t ADDRMAP6;
  uint32_t ADDRMAP9;
  uint32_t ADDRMAP10;
  uint32_t ADDRMAP11;
} HAL_DDR_MapTypeDef;

typedef struct
{
  uint32_t SCHED;
  uint32_t SCHED1;
  uint32_t PERFHPR1;
  uint32_t PERFLPR1;
  uint32_t PERFWR1;
  uint32_t PCFGR_0;
  uint32_t PCFGW_0;
  uint32_t PCFGQOS0_0;
  uint32_t PCFGQOS1_0;
  uint32_t PCFGWQOS0_0;
  uint32_t PCFGWQOS1_0;
#ifdef DDR_DUAL_AXI_PORT
  uint32_t PCFGR_1;
  uint32_t PCFGW_1;
  uint32_t PCFGQOS0_1;
  uint32_t PCFGQOS1_1;
  uint32_t PCFGWQOS0_1;
  uint32_t PCFGWQOS1_1;
#endif /* DDR_DUAL_AXI_PORT */
} HAL_DDR_PerfTypeDef;

typedef struct
{
  uint32_t PGCR;
  uint32_t ACIOCR;
  uint32_t DXCCR;
  uint32_t DSGCR;
  uint32_t DCR;
  uint32_t ODTCR;
  uint32_t ZQ0CR1;
  uint32_t DX0GCR;
  uint32_t DX1GCR;
#ifdef DDR_32BIT_INTERFACE
  uint32_t DX2GCR;
  uint32_t DX3GCR;
#endif /* DDR_32BIT_INTERFACE */
} HAL_DDR_PhyRegTypeDef;

typedef struct
{
  uint32_t PTR0;
  uint32_t PTR1;
  uint32_t PTR2;
  uint32_t DTPR0;
  uint32_t DTPR1;
  uint32_t DTPR2;
  uint32_t MR0;
  uint32_t MR1;
  uint32_t MR2;
  uint32_t MR3;
} HAL_DDR_PhyTimingTypeDef;

typedef struct
{
  const char *name;
  uint32_t speed; /* in kHZ */
  uint32_t size; /* Memory size in byte = col * row * width */
} HAL_DDR_InfoTypeDef;

typedef struct
{
  HAL_DDR_InfoTypeDef      info;
  HAL_DDR_RegTypeDef       c_reg;
  HAL_DDR_TimingTypeDef    c_timing;
  HAL_DDR_MapTypeDef       c_map;
  HAL_DDR_PerfTypeDef      c_perf;
  HAL_DDR_PhyRegTypeDef    p_reg;
  HAL_DDR_PhyTimingTypeDef p_timing;
} HAL_DDR_ConfigTypeDef;

/* Private define ------------------------------------------------------------*/
/** @defgroup DDR_Private_Constants DDR Private Constants
  * @{
  */
#define INVALID_OFFSET 0xFFU

#define DDRCTL_REG(x, y) \
  { \
    .offset = offsetof(DDRCTRL_TypeDef, x), \
    .par_offset = offsetof(y, x) \
  }

#define DDRPHY_REG(x, y) \
  { \
    .offset = offsetof(DDRPHYC_TypeDef, x), \
    .par_offset = offsetof(y, x) \
  }

#define DDRCTL_REG_REG(x) DDRCTL_REG(x, HAL_DDR_RegTypeDef)
static const reg_desc_t ddr_reg_desc[] =
{
  DDRCTL_REG_REG(MSTR),
  DDRCTL_REG_REG(MRCTRL0),
  DDRCTL_REG_REG(MRCTRL1),
  DDRCTL_REG_REG(DERATEEN),
  DDRCTL_REG_REG(DERATEINT),
  DDRCTL_REG_REG(PWRCTL),
  DDRCTL_REG_REG(PWRTMG),
  DDRCTL_REG_REG(HWLPCTL),
  DDRCTL_REG_REG(RFSHCTL0),
  DDRCTL_REG_REG(RFSHCTL3),
  DDRCTL_REG_REG(CRCPARCTL0),
  DDRCTL_REG_REG(ZQCTL0),
  DDRCTL_REG_REG(DFITMG0),
  DDRCTL_REG_REG(DFITMG1),
  DDRCTL_REG_REG(DFILPCFG0),
  DDRCTL_REG_REG(DFIUPD0),
  DDRCTL_REG_REG(DFIUPD1),
  DDRCTL_REG_REG(DFIUPD2),
  DDRCTL_REG_REG(DFIPHYMSTR),
  DDRCTL_REG_REG(ODTMAP),
  DDRCTL_REG_REG(DBG0),
  DDRCTL_REG_REG(DBG1),
  DDRCTL_REG_REG(DBGCMD),
  DDRCTL_REG_REG(POISONCFG),
  DDRCTL_REG_REG(PCCFG),
};

#define DDRCTL_REG_TIMING(x) DDRCTL_REG(x, HAL_DDR_TimingTypeDef)
static const reg_desc_t ddr_timing_desc[] =
{
  DDRCTL_REG_TIMING(RFSHTMG),
  DDRCTL_REG_TIMING(DRAMTMG0),
  DDRCTL_REG_TIMING(DRAMTMG1),
  DDRCTL_REG_TIMING(DRAMTMG2),
  DDRCTL_REG_TIMING(DRAMTMG3),
  DDRCTL_REG_TIMING(DRAMTMG4),
  DDRCTL_REG_TIMING(DRAMTMG5),
  DDRCTL_REG_TIMING(DRAMTMG6),
  DDRCTL_REG_TIMING(DRAMTMG7),
  DDRCTL_REG_TIMING(DRAMTMG8),
  DDRCTL_REG_TIMING(DRAMTMG14),
  DDRCTL_REG_TIMING(ODTCFG),
};

#define DDRCTL_REG_MAP(x) DDRCTL_REG(x, HAL_DDR_MapTypeDef)
static const reg_desc_t ddr_map_desc[] =
{
  DDRCTL_REG_MAP(ADDRMAP1),
  DDRCTL_REG_MAP(ADDRMAP2),
  DDRCTL_REG_MAP(ADDRMAP3),
  DDRCTL_REG_MAP(ADDRMAP4),
  DDRCTL_REG_MAP(ADDRMAP5),
  DDRCTL_REG_MAP(ADDRMAP6),
  DDRCTL_REG_MAP(ADDRMAP9),
  DDRCTL_REG_MAP(ADDRMAP10),
  DDRCTL_REG_MAP(ADDRMAP11),
};

#define DDRCTL_REG_PERF(x) DDRCTL_REG(x, HAL_DDR_PerfTypeDef)
static const reg_desc_t ddr_perf_desc[] =
{
  DDRCTL_REG_PERF(SCHED),
  DDRCTL_REG_PERF(SCHED1),
  DDRCTL_REG_PERF(PERFHPR1),
  DDRCTL_REG_PERF(PERFLPR1),
  DDRCTL_REG_PERF(PERFWR1),
  DDRCTL_REG_PERF(PCFGR_0),
  DDRCTL_REG_PERF(PCFGW_0),
  DDRCTL_REG_PERF(PCFGQOS0_0),
  DDRCTL_REG_PERF(PCFGQOS1_0),
  DDRCTL_REG_PERF(PCFGWQOS0_0),
  DDRCTL_REG_PERF(PCFGWQOS1_0),
#ifdef DDR_DUAL_AXI_PORT
  DDRCTL_REG_PERF(PCFGR_1),
  DDRCTL_REG_PERF(PCFGW_1),
  DDRCTL_REG_PERF(PCFGQOS0_1),
  DDRCTL_REG_PERF(PCFGQOS1_1),
  DDRCTL_REG_PERF(PCFGWQOS0_1),
  DDRCTL_REG_PERF(PCFGWQOS1_1),
#endif /* DDR_DUAL_AXI_PORT */
};

