zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_ddr.c
#define DDRPHY_REG_REG(x) DDRPHY_REG(x, HAL_DDR_PhyRegTypeDef)
static const reg_desc_t ddrphy_reg_desc[] =
{
  DDRPHY_REG_REG(PGCR),
  DDRPHY_REG_REG(ACIOCR),
  DDRPHY_REG_REG(DXCCR),
  DDRPHY_REG_REG(DSGCR),
  DDRPHY_REG_REG(DCR),
  DDRPHY_REG_REG(ODTCR),
  DDRPHY_REG_REG(ZQ0CR1),
  DDRPHY_REG_REG(DX0GCR),
  DDRPHY_REG_REG(DX1GCR),
#ifdef DDR_32BIT_INTERFACE
  DDRPHY_REG_REG(DX2GCR),
  DDRPHY_REG_REG(DX3GCR),
#endif /* DDR_32BIT_INTERFACE */
};

#define DDRPHY_REG_TIMING(x) DDRPHY_REG(x, HAL_DDR_PhyTimingTypeDef)
static const reg_desc_t ddrphy_timing_desc[] =
{
  DDRPHY_REG_TIMING(PTR0),
  DDRPHY_REG_TIMING(PTR1),
  DDRPHY_REG_TIMING(PTR2),
  DDRPHY_REG_TIMING(DTPR0),
  DDRPHY_REG_TIMING(DTPR1),
  DDRPHY_REG_TIMING(DTPR2),
  DDRPHY_REG_TIMING(MR0),
  DDRPHY_REG_TIMING(MR1),
  DDRPHY_REG_TIMING(MR2),
  DDRPHY_REG_TIMING(MR3),
};

#define ARRAY_SIZE(a) (sizeof(a) / sizeof((a)[0]))
static const ddr_reg_info_t ddr_registers[REG_TYPE_NB] =
{
  [REG_REG] = {
    .name = "static",
    .desc = ddr_reg_desc,
    .size = ARRAY_SIZE(ddr_reg_desc),
    .base = BASE_DDRCTRL
  },
  [REG_TIMING] = {
    .name = "timing",
    .desc = ddr_timing_desc,
    .size = ARRAY_SIZE(ddr_timing_desc),
    .base = BASE_DDRCTRL
  },
  [REG_PERF] = {
    .name = "perf",
    .desc = ddr_perf_desc,
    .size = ARRAY_SIZE(ddr_perf_desc),
    .base = BASE_DDRCTRL
  },
  [REG_MAP] = {
    .name = "map",
    .desc = ddr_map_desc,
    .size = ARRAY_SIZE(ddr_map_desc),
    .base = BASE_DDRCTRL
  },
  [REGPHY_REG] = {
    .name = "static",
    .desc = ddrphy_reg_desc,
    .size = ARRAY_SIZE(ddrphy_reg_desc),
    .base = BASE_DDRPHYC
  },
  [REGPHY_TIMING] = {
    .name = "timing",
    .desc = ddrphy_timing_desc,
    .size = ARRAY_SIZE(ddrphy_timing_desc),
    .base = BASE_DDRPHYC
  },
};

#define DDR_DELAY_1_US                       1U
#define DDR_TIMEOUT_1_US                     1U
#define DDR_DELAY_2_US                       2U * DDR_DELAY_1_US
#define DDR_DELAY_10_US                      10U * DDR_DELAY_1_US
#define DDR_DELAY_END_LOGIC_INIT_US          DDR_DELAY_2_US
#define DDR_DELAY_PHY_INIT_US                DDR_DELAY_10_US
#define DDR_TIMEOUT_10_US                    10U * DDR_TIMEOUT_1_US
#define DDR_TIMEOUT_50_US                    50U * DDR_TIMEOUT_1_US
#define DDR_TIMEOUT_500_US                   500U * DDR_TIMEOUT_1_US
#define DDR_TIMEOUT_200_MS                   200000U * DDR_TIMEOUT_1_US
#define DDR_TIMEOUT_1S                       1000000U * DDR_TIMEOUT_1_US

#define TIMESLOT_1US                         (__get_CNTFRQ() / 1000000U)

#define DDRCTRL_MSTR_DATA_BUS_WIDTH_HALF     DDRCTRL_MSTR_DATA_BUS_WIDTH_0
#define DDRCTRL_MSTR_DATA_BUS_WIDTH_QUARTER  DDRCTRL_MSTR_DATA_BUS_WIDTH_1
#define DDRCTRL_STAT_OPERATING_MODE_SR       (DDRCTRL_STAT_OPERATING_MODE_0 | \
                                              DDRCTRL_STAT_OPERATING_MODE_1)
#define DDRCTRL_STAT_OPERATING_MODE_NORMAL   DDRCTRL_STAT_OPERATING_MODE_0
#define DDRCTRL_STAT_SELFREF_TYPE_ASR        (DDRCTRL_STAT_SELFREF_TYPE_0 | \
                                              DDRCTRL_STAT_SELFREF_TYPE_1)
#define DDRCTRL_STAT_SELFREF_TYPE_SR         DDRCTRL_STAT_SELFREF_TYPE_1
#define DDRCTRL_MRCTRL0_MR_TYPE_WRITE        0U
#define DDRCTRL_MRCTRL0_MR_TYPE_READ         DDRCTRL_MRCTRL0_MR_TYPE
#define DDRCTRL_MRCTRL0_MR_RANK_ALL          DDRCTRL_MRCTRL0_MR_RANK
#define DDRCTRL_INIT0_SKIP_DRAM_INIT_NORMAL  DDRCTRL_INIT0_SKIP_DRAM_INIT_0
#define DDRCTRL_DBGCAM_DATA_PIPELINE_EMPTY \
  (DDRCTRL_DBGCAM_WR_DATA_PIPELINE_EMPTY | \
   DDRCTRL_DBGCAM_RD_DATA_PIPELINE_EMPTY)
#define DDRCTRL_DBG_Q_AND_DATA_PIPELINE_EMPTY \
  (DDRCTRL_DBGCAM_DBG_WR_Q_EMPTY | \
   DDRCTRL_DBGCAM_DBG_RD_Q_EMPTY | \
   DDRCTRL_DBGCAM_DATA_PIPELINE_EMPTY)
#define DDRCTRL_DBGCAM_DBG_Q_DEPTH \
  (DDRCTRL_DBGCAM_DBG_WR_Q_EMPTY | \
   DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH | \
   DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH)

#define DDR_BASE_ADDR                        0xC0000000U
#define DDR_MAX_SIZE                         0x40000000U
#define DDR_PATTERN                          0xAAAAAAAAU
#define DDR_ANTIPATTERN                      0x55555555U
#define DDR_TRAINING_AREA_SIZE               64U

#define RCC_DDRITFCR_DDRCKMOD_ASR1           RCC_DDRITFCR_DDRCKMOD_0
#define RCC_DDRITFCR_DDRCKMOD_HSR1           RCC_DDRITFCR_DDRCKMOD_1

#define BKPRAM_ZDATA_OFFSET                  0U

#define SCTLR_C_BIT                          (1U << 2)
/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

static HAL_DDR_ConfigTypeDef static_ddr_config =
{
  .info = {
    .name = DDR_MEM_NAME,
    .speed = DDR_MEM_SPEED,
    .size = DDR_MEM_SIZE
  },

  .c_reg = {
    .MSTR = DDR_MSTR,
    .MRCTRL0 = DDR_MRCTRL0,
    .MRCTRL1 = DDR_MRCTRL1,
    .DERATEEN = DDR_DERATEEN,
    .DERATEINT = DDR_DERATEINT,
    .PWRCTL = DDR_PWRCTL,
    .PWRTMG = DDR_PWRTMG,
    .HWLPCTL = DDR_HWLPCTL,
    .RFSHCTL0 = DDR_RFSHCTL0,
    .RFSHCTL3 = DDR_RFSHCTL3,
    .CRCPARCTL0 = DDR_CRCPARCTL0,
    .ZQCTL0 = DDR_ZQCTL0,
    .DFITMG0 = DDR_DFITMG0,
    .DFITMG1 = DDR_DFITMG1,
    .DFILPCFG0 = DDR_DFILPCFG0,
    .DFIUPD0 = DDR_DFIUPD0,
    .DFIUPD1 = DDR_DFIUPD1,
    .DFIUPD2 = DDR_DFIUPD2,
    .DFIPHYMSTR = DDR_DFIPHYMSTR,
    .ODTMAP = DDR_ODTMAP,
    .DBG0 = DDR_DBG0,
    .DBG1 = DDR_DBG1,
    .DBGCMD = DDR_DBGCMD,
    .POISONCFG = DDR_POISONCFG,
    .PCCFG = DDR_PCCFG
  },

  .c_timing = {
    .RFSHTMG = DDR_RFSHTMG,
    .DRAMTMG0 = DDR_DRAMTMG0,
    .DRAMTMG1 = DDR_DRAMTMG1,
    .DRAMTMG2 = DDR_DRAMTMG2,
    .DRAMTMG3 = DDR_DRAMTMG3,
    .DRAMTMG4 = DDR_DRAMTMG4,
    .DRAMTMG5 = DDR_DRAMTMG5,
    .DRAMTMG6 = DDR_DRAMTMG6,
    .DRAMTMG7 = DDR_DRAMTMG7,
    .DRAMTMG8 = DDR_DRAMTMG8,
    .DRAMTMG14 = DDR_DRAMTMG14,
    .ODTCFG = DDR_ODTCFG
  },


  .c_map = {
    .ADDRMAP1 = DDR_ADDRMAP1,
    .ADDRMAP2 = DDR_ADDRMAP2,
    .ADDRMAP3 = DDR_ADDRMAP3,
    .ADDRMAP4 = DDR_ADDRMAP4,
    .ADDRMAP5 = DDR_ADDRMAP5,
    .ADDRMAP6 = DDR_ADDRMAP6,
    .ADDRMAP9 = DDR_ADDRMAP9,
    .ADDRMAP10 = DDR_ADDRMAP10,
    .ADDRMAP11 = DDR_ADDRMAP11
  },

  .c_perf = {
    .SCHED = DDR_SCHED,
    .SCHED1 = DDR_SCHED1,
    .PERFHPR1 = DDR_PERFHPR1,
    .PERFLPR1 = DDR_PERFLPR1,
    .PERFWR1 = DDR_PERFWR1,
    .PCFGR_0 = DDR_PCFGR_0,
    .PCFGW_0 = DDR_PCFGW_0,
    .PCFGQOS0_0 = DDR_PCFGQOS0_0,
    .PCFGQOS1_0 = DDR_PCFGQOS1_0,
    .PCFGWQOS0_0 = DDR_PCFGWQOS0_0,
    .PCFGWQOS1_0 = DDR_PCFGWQOS1_0,
#ifdef DDR_DUAL_AXI_PORT
    .PCFGR_1 = DDR_PCFGR_1,
    .PCFGW_1 = DDR_PCFGW_1,
    .PCFGQOS0_1 = DDR_PCFGQOS0_1,
    .PCFGQOS1_1 = DDR_PCFGQOS1_1,
    .PCFGWQOS0_1 = DDR_PCFGWQOS0_1,
    .PCFGWQOS1_1 = DDR_PCFGWQOS1_1
#endif /* DDR_DUAL_AXI_PORT */
  },

  .p_reg = {
    .PGCR = DDR_PGCR,
    .ACIOCR = DDR_ACIOCR,
    .DXCCR = DDR_DXCCR,
    .DSGCR = DDR_DSGCR,
    .DCR = DDR_DCR,
    .ODTCR = DDR_ODTCR,
    .ZQ0CR1 = DDR_ZQ0CR1,
    .DX0GCR = DDR_DX0GCR,
    .DX1GCR = DDR_DX1GCR,
#ifdef DDR_32BIT_INTERFACE
    .DX2GCR = DDR_DX2GCR,
    .DX3GCR = DDR_DX3GCR
#endif /* DDR_32BIT_INTERFACE */
  },

