zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_ddr.c
  .p_timing = {
    .PTR0 = DDR_PTR0,
    .PTR1 = DDR_PTR1,
    .PTR2 = DDR_PTR2,
    .DTPR0 = DDR_DTPR0,
    .DTPR1 = DDR_DTPR1,
    .DTPR2 = DDR_DTPR2,
    .MR0 = DDR_MR0,
    .MR1 = DDR_MR1,
    .MR2 = DDR_MR2,
    .MR3 = DDR_MR3
  }
};

/* Private function prototypes -----------------------------------------------*/
/** @defgroup DDR_Private_Functions DDR Private Functions
  * @{
  */

static void ddr_delay_us(uint32_t delay_us)
{
  __IO uint32_t wait_loop_index = 0U;

  wait_loop_index = (delay_us * (SystemCoreClock / (1000000UL * 2UL)));


  while (wait_loop_index != 0UL)
  {
    wait_loop_index--;
  }
}

/**
  * @brief  Initialize DDR timeout in us
  * @param  timeout_us timeout in us
  * @retval wait_loop_index
  */
static __IO uint32_t ddr_timeout_init_us(uint32_t timeout_us)
{
  __IO uint32_t wait_loop_index = 0U;

  wait_loop_index = timeout_us * (SystemCoreClock / (1000000UL * 2UL));


  return wait_loop_index;
}

/**
  * @brief  Check if timeout has expired
  * @param  timeout timeout in us
  * @retval Timeout status
  */
static bool ddr_timeout_elapsed(__IO uint32_t timeout)
{
  if (timeout == 0U)
  {
    return true;
  }

  return false;
}

/**
  * @brief  Save DDR training Area
  * @param  None
  * @retval Return status
  */
#if defined ( __ICCARM__ )
static bool __attribute__((unused)) save_ddr_training_area(void)
#else
static bool __unused save_ddr_training_area(void)
#endif /* __ICCARM__ */
{
  bool ret = true;

  SET_BIT(RCC->MP_AHB5ENSETR, RCC_MP_AHB5ENSETR_BKPSRAMEN);

  if (memcpy((uint32_t *)BKPSRAM_BASE, (uint32_t *)DDR_BASE_ADDR,
             DDR_TRAINING_AREA_SIZE) == NULL)
  {
    ret = false;
  }

  __DSB();

  CLEAR_BIT(RCC->MP_AHB5ENSETR, RCC_MP_AHB5ENSETR_BKPSRAMEN);

  return ret;
}

/**
  * @brief  Restore DDR training Area
  * @param  None
  * @retval Return status
  */
static bool restore_ddr_training_area(void)
{
  bool ret = true;

  SET_BIT(RCC->MP_AHB5ENSETR, RCC_MP_AHB5ENSETR_BKPSRAMEN);

  if (memcpy((uint32_t *)DDR_BASE_ADDR, (uint32_t *)BKPSRAM_BASE,
             DDR_TRAINING_AREA_SIZE) == NULL)
  {
    ret = false;
  }

  __DSB();

  CLEAR_BIT(RCC->MP_AHB5ENSETR, RCC_MP_AHB5ENSETR_BKPSRAMEN);

  return ret;
}

/* board-specific DDR power initializations. */
#if defined ( __ICCARM__ )
__weak int32_t HAL_DDR_MspInit(__attribute__((unused)) ddr_type type)
#else
__weak int32_t HAL_DDR_MspInit(__unused ddr_type type)
#endif /* __ICCARM__ */
{
  return 0;
}

/**
  * @brief  DDR Clock Register Enable
  * @param  None
  * @retval None
  */
static void ddr_enable_clock(void)
{
#ifdef DDR_DUAL_AXI_PORT
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC1EN
                        | RCC_DDRITFCR_DDRC2EN
                        | RCC_DDRITFCR_DDRPHYCEN
                        | RCC_DDRITFCR_DDRPHYCAPBEN
                        | RCC_DDRITFCR_DDRCAPBEN);
#else /* DDR_DUAL_AXI_PORT */
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC1EN
                        | RCC_DDRITFCR_DDRPHYCEN
                        | RCC_DDRITFCR_DDRPHYCAPBEN
                        | RCC_DDRITFCR_DDRCAPBEN);
#endif /* DDR_DUAL_AXI_PORT */
}

/**
  * @brief  Set DDR Clock Speed
  * @param  mem_speed Memory Speed to be set
  * @retval HAL Status
  */
static int32_t ddr_clk_enable(uint32_t mem_speed)
{
  PLL2_ClocksTypeDef PLL2;
  uint32_t ddr_clk;
  uint32_t ddrphy_clk;
  uint32_t mem_speed_hz = mem_speed * 1000U;

  ddr_enable_clock();

  HAL_RCC_GetPLL2ClockFreq(&PLL2);
  ddrphy_clk = PLL2.PLL2_R_Frequency;

  /* Max 10% frequency delta */
  if (ddrphy_clk > mem_speed_hz)
  {
    ddr_clk = ddrphy_clk - mem_speed_hz;
  }
  else
  {
    ddr_clk = mem_speed_hz - ddrphy_clk;
  }

  if (ddr_clk > (mem_speed_hz / (uint32_t)10))
  {
    return -1; /* Return Error if  frequency deviation > 10% */
  }

  return 0;
}

/**
  * @brief  Get DDR Base Register Address
  * @param  base Base Register Type
  * @retval Return DDR Base Register Address
  */
static uint32_t get_base_addr(base_type base)
{
  if (base == BASE_DDRPHYC)
  {
    return (uint32_t)DDRPHYC_BASE;
  }
  else
  {
    return (uint32_t)DDRCTRL_BASE;
  }
}

/**
  * @brief  Set DDR Base Register Address
  * @param  base Base Register Type
  * @retval HAL Status
  */
static HAL_StatusTypeDef set_reg(reg_type type, uint32_t param)
{
  uint8_t i;
  uint32_t base_addr = get_base_addr(ddr_registers[type].base);
  const reg_desc_t *desc = ddr_registers[type].desc;

  for (i = 0; i < ddr_registers[type].size; i++)
  {
    if (desc[i].par_offset == INVALID_OFFSET)
    {
      return HAL_ERROR;
    }
    else
    {
      uint32_t address = param + (uint32_t)desc[i].par_offset;
      uint32_t *ptr = (uint32_t *)address;

      WRITE_REG(*(volatile uint32_t *)(base_addr + (uint32_t)desc[i].offset),
                *ptr);
    }
  }

  return HAL_OK;
}

static HAL_StatusTypeDef ddrphy_idone_wait(void)
{
  uint32_t pgsr;
  uint32_t error = 0U;
  uint32_t errormask = DDRPHYC_PGSR_DTERR | DDRPHYC_PGSR_DTIERR
                       | DDRPHYC_PGSR_DFTERR | DDRPHYC_PGSR_RVERR
                       | DDRPHYC_PGSR_RVEIRR;
  __IO uint32_t timeout = ddr_timeout_init_us(DDR_TIMEOUT_50_US);

  do
  {
    pgsr = READ_REG(DDRPHYC->PGSR);

    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT; /* Timeout initialising DRAM */
    }

    if ((pgsr & errormask) != 0U)
    {
      error++;
    }
  } while (((pgsr & DDRPHYC_PGSR_IDONE) == 0U) && (error == 0U));

  return HAL_OK;
}

static HAL_StatusTypeDef HAL_DDR_PHY_Init(uint32_t pir)
{
  uint32_t pir_init = pir | DDRPHYC_PIR_INIT;

  WRITE_REG(DDRPHYC->PIR, pir_init);

  /* Need to wait 10 configuration clock before start polling */
  ddr_delay_us(DDR_DELAY_PHY_INIT_US);

  /* Wait DRAM initialization and Gate Training Evaluation complete */
  return ddrphy_idone_wait();
}

static HAL_StatusTypeDef self_refresh_zcal(uint32_t zdata)
{
  /* sequence for PUBL I/O Data Retention during Power-Down */

  /* 10. Override ZQ calibration with previously (pre-retention)
   *     calibrated values. This is done by writing 1 to ZQ0CRN.ZDEN
   *     and the override data to ZQ0CRN.ZDATA.
   */
  SET_BIT(DDRPHYC->ZQ0CR0, DDRPHYC_ZQ0CR0_ZDEN);

