zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_ddr.c
  MODIFY_REG(DDRPHYC->ZQ0CR0,
             DDRPHYC_ZQ0CR0_ZDATA_Msk,
             zdata << DDRPHYC_ZQ0CR0_ZDATA_Pos);

  /* 11. De-assert the PHY_top data retention enable signals
   *     (ret_en or ret_en_i/ret_en_n_i).
   */
  SET_BIT(PWR->CR3, PWR_CR3_DDRSRDIS);
  CLEAR_BIT(PWR->CR3, PWR_CR3_DDRRETEN);

  /* 12. Remove ZQ calibration override by writing 0 to ZQ0CRN.ZDEN. */
  CLEAR_BIT(DDRPHYC->ZQ0CR0, DDRPHYC_ZQ0CR0_ZDEN);

  /* 13. Trigger ZQ calibration by writing 1 to PIR.INIT
   *     and '1' to PIR.ZCAL
   */
  /* 14. Wait for ZQ calibration to finish by polling a 1 status
   * on PGSR.IDONE.
   */
  return HAL_DDR_PHY_Init(DDRPHYC_PIR_ZCAL);
}

/* Start quasi dynamic register update */
static void start_sw_done(void)
{
  CLEAR_BIT(DDRCTRL->SWCTL, DDRCTRL_SWCTL_SW_DONE);
}

/* Wait quasi dynamic register update */
static HAL_StatusTypeDef wait_sw_done_ack(void)
{
  uint32_t swstat;
  __IO uint32_t timeout = ddr_timeout_init_us(DDR_TIMEOUT_1_US);

  SET_BIT(DDRCTRL->SWCTL, DDRCTRL_SWCTL_SW_DONE);

  do
  {
    swstat = READ_REG(DDRCTRL->SWSTAT);

    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT; /* Timeout initialising DRAM */
    }
  } while ((swstat & DDRCTRL_SWSTAT_SW_DONE_ACK) == 0U);

  return HAL_OK;
}

/* Wait quasi dynamic register update */
static HAL_StatusTypeDef wait_operating_mode(uint32_t mode)
{
  uint32_t stat;
  uint32_t break_loop = 0U;
  __IO uint32_t timeout = ddr_timeout_init_us(DDR_TIMEOUT_1_US);

  for (; ;)
  {
    uint32_t operating_mode;
    uint32_t selref_type;

    stat = READ_REG(DDRCTRL->STAT);
    operating_mode = stat & DDRCTRL_STAT_OPERATING_MODE_Msk;
    selref_type = stat & DDRCTRL_STAT_SELFREF_TYPE_Msk;

    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT; /* Timeout initialising DRAM */
    }

    if (mode == DDRCTRL_STAT_OPERATING_MODE_SR)
    {
      /*
       * Self-refresh due to software
       * => checking also STAT.selfref_type.
       */
      if ((operating_mode == DDRCTRL_STAT_OPERATING_MODE_SR)
          && (selref_type == DDRCTRL_STAT_SELFREF_TYPE_SR))
      {
        break_loop = 1U;
      }
    }
    else if (operating_mode == mode)
    {
      break_loop = 1U;
    }
    else if ((mode == DDRCTRL_STAT_OPERATING_MODE_NORMAL)
             && (operating_mode == DDRCTRL_STAT_OPERATING_MODE_SR)
             && (selref_type == DDRCTRL_STAT_SELFREF_TYPE_ASR))
    {
      /* Normal mode: handle also automatic self refresh */
      break_loop = 1U;
    }
    else
    {
      /* Continue loop */
    }

    if (break_loop == 1U)
    {
      break;
    }
  }

  return HAL_OK;
}

static void enable_axi_port(void)
{
  /* Enable uMCTL2 AXI port 0 */
  SET_BIT(DDRCTRL->PCTRL_0, DDRCTRL_PCTRL_0_PORT_EN);

#ifdef DDR_DUAL_AXI_PORT
  /* Enable uMCTL2 AXI port 1 */
  SET_BIT(DDRCTRL->PCTRL_1, DDRCTRL_PCTRL_0_PORT_EN);
#endif /* DDR_DUAL_AXI_PORT */
}

static int32_t disable_axi_port(void)
{
  __IO uint32_t timeout;

  /* Disable uMCTL2 AXI port 0 */
  CLEAR_BIT(DDRCTRL->PCTRL_0, DDRCTRL_PCTRL_0_PORT_EN);
#ifdef DDR_DUAL_AXI_PORT
  CLEAR_BIT(DDRCTRL->PCTRL_1, DDRCTRL_PCTRL_0_PORT_EN);
#endif  /* DDR_DUAL_AXI_PORT */

  /* Waits unit all AXI ports are idle
   * Poll PSTAT.rd_port_busy_n = 0
   * Poll PSTAT.wr_port_busy_n = 0
   */
  timeout = ddr_timeout_init_us(DDR_TIMEOUT_1S);
  while (READ_REG(DDRCTRL->PSTAT) != 0U)
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return -1;
    }
  }

  return 0;
}

static void enable_host_interface(void)
{
  CLEAR_BIT(DDRCTRL->DBG1, DDRCTRL_DBG1_DIS_HIF);
}

static int32_t disable_host_interface(void)
{
  __IO uint32_t timeout;
  uint32_t dbgcam;
  uint32_t count = 0;

  SET_BIT(DDRCTRL->DBG1, DDRCTRL_DBG1_DIS_HIF);

  /*
   * Waits until all queues and pipelines are empty
   * Poll DBGCAM.dbg_wr_q_empty = 1
   * Poll DBGCAM.dbg_rd_q_empty = 1
   * Poll DBGCAM.dbg_wr_data_pipeline_empty = 1
   * Poll DBGCAM.dbg_rd_data_pipeline_empty = 1
   *
   * data_pipeline fields must be polled twice to ensure
   * value propoagation, so count is added to loop condition.
   */
  timeout = ddr_timeout_init_us(DDR_TIMEOUT_1S);
  do
  {
    dbgcam = READ_REG(DDRCTRL->DBGCAM);
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return -1;
    }
    count++;
  } while (((dbgcam & DDRCTRL_DBG_Q_AND_DATA_PIPELINE_EMPTY) !=
            DDRCTRL_DBG_Q_AND_DATA_PIPELINE_EMPTY) || (count < 2U));

  return 0;
}

static int32_t sw_selfref_entry(void)
{
  __IO uint32_t timeout;
  uint32_t stat;
  uint32_t operating_mode;
  uint32_t selref_type;

  /* SW Self-Refresh entry */
  SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_SW);

  /* Wait operating mode change in self-refresh mode
   * with STAT.operating_mode[1:0]==11.
   * Ensure transition to self-refresh was due to software
   * by checking also that STAT.selfref_type[1:0]=2.
   */
  timeout = ddr_timeout_init_us(DDR_TIMEOUT_500_US);

  while (!ddr_timeout_elapsed(timeout))
  {
    stat = READ_REG(DDRCTRL->STAT);
    operating_mode = stat & DDRCTRL_STAT_OPERATING_MODE_Msk;
    selref_type = stat & DDRCTRL_STAT_SELFREF_TYPE_Msk;
    timeout--;

    if ((operating_mode == DDRCTRL_STAT_OPERATING_MODE_SR)
        && (selref_type == DDRCTRL_STAT_SELFREF_TYPE_SR))
    {
      return 0;
    }
  }

  return -1;
}

static void sw_selfref_exit(void)
{
  CLEAR_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_SW);
}

static int32_t set_qd3_update_conditions(void)
{
  if (disable_axi_port() != 0)
  {
    return -1;
  }
  if (disable_host_interface() != 0)
  {
    return -1;
  }
  start_sw_done();

  return 0;
}

static HAL_StatusTypeDef unset_qd3_update_conditions(void)
{
  HAL_StatusTypeDef ret;

  ret = wait_sw_done_ack();
  if (ret != HAL_OK)
  {
    return ret;
  }
  enable_host_interface();
  enable_axi_port();

  return ret;
}

static int32_t wait_refresh_update_done_ack(void)
{
  __IO uint32_t timeout;
  uint32_t rfshctl3;
  uint32_t refresh_update_level  = DDRCTRL_RFSHCTL3_REFRESH_UPDATE_LEVEL;

  /* Toggle rfshctl3.refresh_update_level */
  rfshctl3 = READ_REG(DDRCTRL->RFSHCTL3);
  if ((rfshctl3 & refresh_update_level) == refresh_update_level)
  {
    SET_BIT(DDRCTRL->RFSHCTL3, refresh_update_level);
  }
  else
  {
    CLEAR_BIT(DDRCTRL->RFSHCTL3, refresh_update_level);
    refresh_update_level = 0U;
  }

