zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_ddr.c
  timeout = ddr_timeout_init_us(DDR_TIMEOUT_1S);
  do
  {
    rfshctl3 = READ_REG(DDRCTRL->RFSHCTL3);
    timeout--;

    if (ddr_timeout_elapsed(timeout))
    {
      return -1;
    }
  } while ((rfshctl3 & DDRCTRL_RFSHCTL3_REFRESH_UPDATE_LEVEL) !=
           refresh_update_level);

  return 0;
}

/* Mode Register Writes (MRW or MRS) */
static HAL_StatusTypeDef mode_register_write(uint32_t addr, uint32_t data)
{
  uint32_t mrctrl0;
  __IO uint32_t timeout = ddr_timeout_init_us(DDR_TIMEOUT_200_MS);

  /*
   * 1. Poll MRSTAT.mr_wr_busy until it is '0'.
   *    This checks that there is no outstanding MR transaction.
   *    No write should be performed to MRCTRL0 and MRCTRL1
   *    if MRSTAT.mr_wr_busy = 1.
   */
  while ((READ_REG(DDRCTRL->MRSTAT) & DDRCTRL_MRSTAT_MR_WR_BUSY) != 0U)
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT;
    }
  }

  /*
   * 2. Write the MRCTRL0.mr_type, MRCTRL0.mr_addr, MRCTRL0.mr_rank
   *    and (for MRWs) MRCTRL1.mr_data to define the MR transaction.
   */
  mrctrl0 = DDRCTRL_MRCTRL0_MR_TYPE_WRITE
            | DDRCTRL_MRCTRL0_MR_RANK_ALL
            | ((addr << DDRCTRL_MRCTRL0_MR_ADDR_Pos)
               & DDRCTRL_MRCTRL0_MR_ADDR_Msk);

  WRITE_REG(DDRCTRL->MRCTRL0, mrctrl0);
  WRITE_REG(DDRCTRL->MRCTRL1, data);

  /*
   * 3. In a separate APB transaction, write the MRCTRL0.mr_wr to 1. This
   *    bit is self-clearing, and triggers the MR transaction.
   *    The uMCTL2 then asserts the MRSTAT.mr_wr_busy while it performs
   *    the MR transaction to SDRAM, and no further access can be
   *    initiated until it is deasserted.
   */
  mrctrl0 |= DDRCTRL_MRCTRL0_MR_WR;
  WRITE_REG(DDRCTRL->MRCTRL0, mrctrl0);

  timeout = ddr_timeout_init_us(DDR_TIMEOUT_200_MS);
  while ((READ_REG(DDRCTRL->MRSTAT) & DDRCTRL_MRSTAT_MR_WR_BUSY) != 0U)
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT;
    }
  }

  return HAL_OK;
}

/* Switch DDR3 from DLL-on to DLL-off */
static HAL_StatusTypeDef ddr3_dll_off(void)
{
  HAL_StatusTypeDef ret;
  uint32_t mr1 = READ_REG(DDRPHYC->MR1);
  uint32_t mr2 = READ_REG(DDRPHYC->MR2);
  uint32_t dbgcam;
  __IO uint32_t timeout = ddr_timeout_init_us(DDR_TIMEOUT_200_MS);

  /*
   * 1. Set the DBG1.dis_hif = 1.
   *    This prevents further reads/writes being received on the HIF.
   */
  SET_BIT(DDRCTRL->DBG1, DDRCTRL_DBG1_DIS_HIF);

  /*
   * 2. Ensure all commands have been flushed from the uMCTL2 by polling
   *    DBGCAM.wr_data_pipeline_empty = 1,
   *    DBGCAM.rd_data_pipeline_empty = 1,
   *    DBGCAM.dbg_wr_q_depth = 0 ,
   *    DBGCAM.dbg_lpr_q_depth = 0, and
   *    DBGCAM.dbg_hpr_q_depth = 0.
   */
  do
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT;
    }

    dbgcam = READ_REG(DDRCTRL->DBGCAM);
  } while ((((dbgcam & DDRCTRL_DBGCAM_DATA_PIPELINE_EMPTY)
             == DDRCTRL_DBGCAM_DATA_PIPELINE_EMPTY))
           && ((dbgcam & DDRCTRL_DBGCAM_DBG_Q_DEPTH) == 0U));

  /*
   * 3. Perform an MRS command (using MRCTRL0 and MRCTRL1 registers)
   *    to disable RTT_NOM:
   *    a. DDR3: Write to MR1[9], MR1[6] and MR1[2]
   *    b. DDR4: Write to MR1[10:8]
   */
  mr1 &= ~(DDRPHYC_MR1_RTT0 | DDRPHYC_MR1_RTT1
           | DDRPHYC_MR1_RTT2);
  ret = mode_register_write(1U, mr1);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   * 4. For DDR4 only: Perform an MRS command
   *    (using MRCTRL0 and MRCTRL1 registers) to write to MR5[8:6]
   *    to disable RTT_PARK
   */

  /*
   * 5. Perform an MRS command (using MRCTRL0 and MRCTRL1 registers)
   *    to write to MR2[10:9], to disable RTT_WR
   *    (and therefore disable dynamic ODT).
   *    This applies for both DDR3 and DDR4.
   */
  mr2 &= ~DDRPHYC_MR2_RTTWR_Msk;
  ret = mode_register_write(2U, mr2);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   * 6. Perform an MRS command (using MRCTRL0 and MRCTRL1 registers)
   *    to disable the DLL. The timing of this MRS is automatically
   *    handled by the uMCTL2.
   *    a. DDR3: Write to MR1[0]
   *    b. DDR4: Write to MR1[0]
   */
  mr1 |= DDRPHYC_MR1_DE;
  ret = mode_register_write(1U, mr1);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   * 7. Put the SDRAM into self-refresh mode by setting
   *    PWRCTL.selfref_sw = 1, and polling STAT.operating_mode to ensure
   *    the DDRC has entered self-refresh.
   */
  SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_SW);

  /*
   * 8. Wait until STAT.operating_mode[1:0]==11 indicating that the
   *    DWC_ddr_umctl2 core is in self-refresh mode.
   *    Ensure transition to self-refresh was due to software
   *    by checking that STAT.selfref_type[1:0]=2.
   */
  ret = wait_operating_mode(DDRCTRL_STAT_OPERATING_MODE_SR);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   * 9. Set the MSTR.dll_off_mode = 1.
   *    warning: MSTR.dll_off_mode is a quasi-dynamic type 2 field
   */
  start_sw_done();

  SET_BIT(DDRCTRL->MSTR, DDRCTRL_MSTR_DLL_OFF_MODE);

  ret = wait_sw_done_ack();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* 10. Change the clock frequency to the desired value. */

  /*
   * 11. Update any registers which may be required to change for the new
   *     frequency. This includes static and dynamic registers.
   *     This includes both uMCTL2 registers and PHY registers.
   */

  /* Change Bypass Mode Frequency Range (depends on DDRPHYC_CLK_RATE) */
  if (static_ddr_config.info.speed < 100000U)
  {
    CLEAR_BIT(DDRPHYC->DLLGCR, DDRPHYC_DLLGCR_BPS200);
  }
  else
  {
    SET_BIT(DDRPHYC->DLLGCR, DDRPHYC_DLLGCR_BPS200);
  }

  SET_BIT(DDRPHYC->ACDLLCR, DDRPHYC_ACDLLCR_DLLDIS);

  SET_BIT(DDRPHYC->DX0DLLCR, DDRPHYC_DX0DLLCR_DLLDIS);
  SET_BIT(DDRPHYC->DX1DLLCR, DDRPHYC_DX1DLLCR_DLLDIS);
#ifdef DDR_32BIT_INTERFACE
  SET_BIT(DDRPHYC->DX2DLLCR, DDRPHYC_DX2DLLCR_DLLDIS);
  SET_BIT(DDRPHYC->DX3DLLCR, DDRPHYC_DX3DLLCR_DLLDIS);
#endif /* DDR_32BIT_INTERFACE */

  /* 12. Exit the self-refresh state by setting PWRCTL.selfref_sw = 0. */
  CLEAR_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_SW);
  ret = wait_operating_mode(DDRCTRL_STAT_OPERATING_MODE_NORMAL);
  if (ret != HAL_OK)
  {
    return ret;
  }

