zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_ddr.c
  /*
   * 13. If ZQCTL0.dis_srx_zqcl = 0, the uMCTL2 performs a ZQCL command
   *     at this point.
   */

  /*
   * 14. Perform MRS commands as required to re-program timing registers
   *     in the SDRAM for the new frequency
   *     (in particular, CL, CWL and WR may need to be changed).
   */

  /* 15. Write DBG1.dis_hif = 0 to re-enable reads and writes. */
  CLEAR_BIT(DDRCTRL->DBG1, DDRCTRL_DBG1_DIS_HIF);

  return ret;
}

static HAL_StatusTypeDef HAL_DDR_Refresh_Disable(void)
{
  HAL_StatusTypeDef ret;

  /*
   * manage quasi-dynamic registers modification
   * dfimisc.dfi_init_complete_en : Group 3
   * AXI ports not yet enabled, don't disable them
   */
  if (disable_host_interface() != 0)
  {
    return HAL_ERROR;
  }

  start_sw_done();

  /* Quasi-dynamic register update*/
  SET_BIT(DDRCTRL->RFSHCTL3, DDRCTRL_RFSHCTL3_DIS_AUTO_REFRESH);

  if (wait_refresh_update_done_ack() != 0)
  {
    return HAL_ERROR;
  }

  CLEAR_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_POWERDOWN_EN
                            | DDRCTRL_PWRCTL_SELFREF_EN);
  CLEAR_BIT(DDRCTRL->DFIMISC, DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);

  ret = wait_sw_done_ack();
  if (ret != HAL_OK)
  {
    return ret;
  }

  enable_host_interface();

  return HAL_OK;
}

static HAL_StatusTypeDef HAL_DDR_Refresh_Restore(uint32_t rfshctl3, uint32_t pwrctl)
{
  HAL_StatusTypeDef ret;

  /*
   * manage quasi-dynamic registers modification
   * dfimisc.dfi_init_complete_en : Group 3
   * AXI ports not yet enabled, don't disable them
   */
  if (disable_host_interface() != 0)
  {
    return HAL_ERROR;
  }

  start_sw_done();

  if ((rfshctl3 & DDRCTRL_RFSHCTL3_DIS_AUTO_REFRESH) == 0U)
  {
    CLEAR_BIT(DDRCTRL->RFSHCTL3, DDRCTRL_RFSHCTL3_DIS_AUTO_REFRESH);
    if (wait_refresh_update_done_ack() != 0)
    {
      return HAL_ERROR;
    }
  }

  if ((pwrctl & DDRCTRL_PWRCTL_POWERDOWN_EN) != 0U)
  {
    SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_POWERDOWN_EN);
  }

  if ((pwrctl & DDRCTRL_PWRCTL_SELFREF_EN) != 0U)
  {
    SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_EN);
  }

  SET_BIT(DDRCTRL->DFIMISC, DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);

  ret = wait_sw_done_ack();
  if (ret != HAL_OK)
  {
    return ret;
  }

  enable_host_interface();

  return HAL_OK;
}

static uint32_t get_timer(uint32_t base)
{
  return (uint32_t)PL1_GetCurrentPhysicalValue() - base;
}

static HAL_StatusTypeDef refresh_cmd(void)
{
  uint32_t dbgstat;
  __IO uint32_t timeout = ddr_timeout_init_us(DDR_TIMEOUT_200_MS);

  do
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT;
    }

    dbgstat = READ_REG(DDRCTRL->DBGSTAT);
  } while ((dbgstat & DDRCTRL_DBGSTAT_RANK0_REFRESH_BUSY) != 0U);

  SET_BIT(DDRCTRL->DBGCMD, DDRCTRL_DBGCMD_RANK0_REFRESH);

  return HAL_OK;
}

/* Refresh compensation by forcing refresh command
 * Rule1: Tref should be always < tREFW ? R x tREBW/8
 * Rule2: refcomp = RU(Tref/tREFI)  = RU(RxTref/tREFW)
 */
static HAL_StatusTypeDef refresh_compensation(uint32_t start)
{
  HAL_StatusTypeDef res = HAL_OK;
  uint32_t tck_ps;
  uint32_t tref;
  uint32_t trefi;
  uint32_t refcomp;
  uint32_t i;
  uint32_t time;
  uint32_t time_us;

  time = get_timer(start);
  time_us = time / TIMESLOT_1US;

  tck_ps = 1000000000U / static_ddr_config.info.speed;
  if (tck_ps == 0U)
  {
    return res;
  }

  /* ref = refresh time in tck */
  tref = time_us * 1000000U / tck_ps;

  trefi = ((READ_REG(DDRCTRL->RFSHTMG) & DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Msk)
           >> DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos) * 32U;
  if (trefi == 0U)
  {
    return res;
  }

  /* div round up : number of refresh to compensate */
  refcomp = (tref + trefi - 1U) / trefi;

  for (i = 0U; i < refcomp; i++)
  {
    res = refresh_cmd();
    if (res != HAL_OK)
    {
      return res;
    }
  }

  return res;
}

static int32_t ddr_sw_self_refresh_in(void)
{
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);

  if (disable_axi_port() != 0)
  {
    /* pstat failed */
    enable_axi_port();

    return -1;
  }

  /* SW Self-Refresh entry */
  if (sw_selfref_entry() != 0)
  {
    /* selfref_sw_failed: restore DDR in its previous state */
    sw_selfref_exit();

    enable_axi_port();

    return -1;
  }

  /* IOs powering down (PUBL registers) */
  SET_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_ACPDD);
  SET_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_ACPDR);
  MODIFY_REG(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_CKPDD_Msk, DDRPHYC_ACIOCR_CKPDD_0);
  MODIFY_REG(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_CKPDR_Msk, DDRPHYC_ACIOCR_CKPDR_0);
  SET_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_CSPDD);

  /* Disable command/address output driver */
  CLEAR_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_ACOE);
  SET_BIT(DDRPHYC->DXCCR, DDRPHYC_DXCCR_DXPDD);
  SET_BIT(DDRPHYC->DXCCR, DDRPHYC_DXCCR_DXPDR);
  SET_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_ODTPDD);
  SET_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_NL2PD);
  SET_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_CKEPDD);

  /* Disable PZQ cell (PUBL register) */
  SET_BIT(DDRPHYC->ZQ0CR0, DDRPHYC_ZQ0CR0_ZQPD);

  /* Set latch */
  CLEAR_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_CKOE);

  /* Additional delay to avoid early latch, 10us */
  ddr_delay_us(DDR_DELAY_10_US);

  /* Activate sw retention in PWRCTRL */
  SET_BIT(PWR->CR3, PWR_CR3_DDRRETEN);

  /* Switch controller clocks (uMCTL2/PUBL) to DLL ref clock */
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_GSKPCTRL);

  /* Disable all DLLs: GLITCH window */
  SET_BIT(DDRPHYC->ACDLLCR, DDRPHYC_ACDLLCR_DLLDIS);
  SET_BIT(DDRPHYC->DX0DLLCR, DDRPHYC_DX0DLLCR_DLLDIS);
  SET_BIT(DDRPHYC->DX1DLLCR, DDRPHYC_DX1DLLCR_DLLDIS);
#ifdef DDR_32BIT_INTERFACE
  SET_BIT(DDRPHYC->DX2DLLCR, DDRPHYC_DX2DLLCR_DLLDIS);
  SET_BIT(DDRPHYC->DX3DLLCR, DDRPHYC_DX3DLLCR_DLLDIS);
#endif /* DDR_32BIT_INTERFACE */

  /* Switch controller clocks (uMCTL2/PUBL) to DLL output clock */
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_GSKPCTRL);

  /* Deactivate all DDR clocks */
#ifdef DDR_DUAL_AXI_PORT
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC1EN
                          | RCC_DDRITFCR_DDRC2EN
                          | RCC_DDRITFCR_DDRCAPBEN
                          | RCC_DDRITFCR_DDRPHYCAPBEN);
#else /* DDR_DUAL_AXI_PORT */
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC1EN
                          | RCC_DDRITFCR_DDRCAPBEN
                          | RCC_DDRITFCR_DDRPHYCAPBEN);
#endif /* DDR_DUAL_AXI_PORT */

