zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_ddr.c
  return 0;
}

/*******************************************************************************
  * This function tests a simple read/write access to the DDR.
  * Note that the previous content is restored after test.
  * Returns 0 if success, and address value else.
  ******************************************************************************/
static uint32_t ddr_test_rw_access(void)
{
  uint32_t saved_value = READ_REG(*(volatile uint32_t *)DDR_BASE_ADDR);

  WRITE_REG(*(volatile uint32_t *)DDR_BASE_ADDR, DDR_PATTERN);

  if (READ_REG(*(volatile uint32_t *)DDR_BASE_ADDR) != DDR_PATTERN)
  {
    return (uint32_t)DDR_BASE_ADDR;
  }

  WRITE_REG(*(volatile uint32_t *)DDR_BASE_ADDR, saved_value);

  return 0U;
}

/*******************************************************************************
  * This function tests the DDR data bus wiring.
  * This is inspired from the Data Bus Test algorithm written by Michael Barr
  * in "Programming Embedded Systems in C and C++" book.
  * resources.oreilly.com/examples/9781565923546/blob/master/Chapter6/
  * File: memtest.c - This source code belongs to Public Domain.
  * Returns 0 if success, and address value else.
  ******************************************************************************/
static uint32_t ddr_test_data_bus(void)
{
  uint32_t i;
  uint32_t pattern;

  for (i = 0U; i < 32U; i++)
  {
    pattern = (uint32_t)1 << i;

    WRITE_REG(*(volatile uint32_t *)DDR_BASE_ADDR, pattern);

    if (READ_REG(*(volatile uint32_t *)DDR_BASE_ADDR) != pattern)
    {
      return (uint32_t)DDR_BASE_ADDR;
    }
  }

  return 0U;
}

/*******************************************************************************
  * This function tests the DDR address bus wiring.
  * This is inspired from the Data Bus Test algorithm written by Michael Barr
  * in "Programming Embedded Systems in C and C++" book.
  * resources.oreilly.com/examples/9781565923546/blob/master/Chapter6/
  * File: memtest.c - This source code belongs to Public Domain.
  * Returns 0 if success, and address value else.
  ******************************************************************************/
static uint32_t ddr_test_addr_bus(void)
{
  uint32_t addressmask = (static_ddr_config.info.size - 1U);
  uint32_t offset;
  uint32_t testoffset = 0;

  /* Write the default pattern at each of the power-of-two offsets. */
  for (offset = sizeof(uint32_t); (offset & addressmask) != 0U; offset <<= 1)
  {
    WRITE_REG(*(volatile uint32_t *)(DDR_BASE_ADDR + (uint32_t)offset),
              DDR_PATTERN);
  }

  /* Check for address bits stuck high. */
  WRITE_REG(*(volatile uint32_t *)(DDR_BASE_ADDR + (uint32_t)testoffset),
            DDR_ANTIPATTERN);

  for (offset = sizeof(uint32_t); (offset & addressmask) != 0U; offset <<= 1)
  {
    if (READ_REG(*(volatile uint32_t *)(DDR_BASE_ADDR + (uint32_t)offset))
        != DDR_PATTERN)
    {
      return (uint32_t)(DDR_BASE_ADDR + offset);
    }
  }

  WRITE_REG(*(volatile uint32_t *)(DDR_BASE_ADDR + (uint32_t)testoffset),
            DDR_PATTERN);

  /* Check for address bits stuck low or shorted. */
  for (testoffset = sizeof(uint32_t); (testoffset & addressmask) != 0U;
       testoffset <<= 1)
  {
    WRITE_REG(*(volatile uint32_t *)(DDR_BASE_ADDR + (uint32_t)testoffset),
              DDR_ANTIPATTERN);

    if (READ_REG(*(volatile uint32_t *)DDR_BASE_ADDR) != DDR_PATTERN)
    {
      return DDR_BASE_ADDR;
    }

    for (offset = sizeof(uint32_t); (offset & addressmask) != 0U;
         offset <<= 1)
    {
      if ((READ_REG(*(volatile uint32_t *)(DDR_BASE_ADDR + (uint32_t)offset))
           != DDR_PATTERN)
          && (offset != testoffset))
      {
        return (uint32_t)(DDR_BASE_ADDR + offset);
      }
    }

    WRITE_REG(*(volatile uint32_t *)(DDR_BASE_ADDR + (uint32_t)testoffset),
              DDR_PATTERN);
  }

  return 0U;
}

/*******************************************************************************
  * This function checks the DDR size. It has to be run with Data Cache off.
  * This test is run before data have been put in DDR, and is only done for
  * cold boot. The DDR data can then be overwritten, and it is not useful to
  * restore its content.
  * Returns DDR computed size.
  ******************************************************************************/
static uint32_t ddr_check_size(void)
{
  uint32_t offset = sizeof(uint32_t);

  WRITE_REG(*(volatile uint32_t *)DDR_BASE_ADDR, DDR_PATTERN);

  while (offset < DDR_MAX_SIZE)
  {
    WRITE_REG(*(volatile uint32_t *)(DDR_BASE_ADDR + offset), DDR_ANTIPATTERN);
    __DSB();

    if (READ_REG(*(volatile uint32_t *)DDR_BASE_ADDR) != DDR_PATTERN)
    {
      break;
    }

    offset <<= 1;
  }

  return offset;
}

static bool ddr_supports_ssr_asr(void)
{
  uint32_t mstr = READ_REG(DDRCTRL->MSTR);

  return (mstr & DDRCTRL_MSTR_LPDDR2) != 0U;
}

static HAL_StatusTypeDef ddr_sr_mode_ssr(void)
{
  HAL_StatusTypeDef ret;

  if (!ddr_supports_ssr_asr())
  {
    return HAL_OK;
  }

  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC1LPEN);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC1EN);
#ifdef DDR_DUAL_AXI_PORT
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC2LPEN);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC2EN);
#endif /* DDR_DUAL_AXI_PORT */
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCAPBLPEN);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRPHYCAPBLPEN);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCAPBEN);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRPHYCAPBEN);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRPHYCEN);
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCKMOD_Msk);

  /**
    * manage quasi-dynamic registers modification
    * hwlpctl.hw_lp_en : Group 3
    * pwrtmg.selfref_to_x32 & powerdown_to_x32 : Group 4
    * Group 3 is the most restrictive, apply its conditions for all
    */
  if (set_qd3_update_conditions() != 0)
  {
    return HAL_ERROR;
  }

  /* Disable HW LP interface of uMCTL2 */
  CLEAR_BIT(DDRCTRL->HWLPCTL, DDRCTRL_HWLPCTL_HW_LP_EN);

  /* Configure Automatic LP modes of uMCTL2 */
  MODIFY_REG(DDRCTRL->PWRTMG, DDRCTRL_PWRTMG_SELFREF_TO_X32_Msk,
             DDRCTRL_PWRTMG_SELFREF_TO_X32_0);

  ret = unset_qd3_update_conditions();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /**
    * Disable Clock disable with LP modes
    * (used in RUN mode for LPDDR2 with specific timing).
    */
  CLEAR_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE);

  /* Disable automatic Self-Refresh mode */
  CLEAR_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_EN);

  return ret;
}

static HAL_StatusTypeDef ddr_sr_mode_asr(void)
{
  HAL_StatusTypeDef ret;

  if (!ddr_supports_ssr_asr())
  {
    return HAL_OK;
  }

  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC1LPEN);
#ifdef DDR_DUAL_AXI_PORT
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC2LPEN);
#endif /* DDR_DUAL_AXI_PORT */
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRPHYCLPEN);
  MODIFY_REG(RCC->DDRITFCR, RCC_DDRITFCR_DDRCKMOD_Msk,
             RCC_DDRITFCR_DDRCKMOD_ASR1);

  /**
    * manage quasi-dynamic registers modification
    * hwlpctl.hw_lp_en : Group 3
    * pwrtmg.selfref_to_x32 & powerdown_to_x32 : Group 4
    * Group 3 is the most restrictive, apply its conditions for all
    */
  if (set_qd3_update_conditions() != 0)
  {
    return HAL_ERROR;
  }

