zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_ddr.c
  /* Enable HW LP interface of uMCTL2 */
  SET_BIT(DDRCTRL->HWLPCTL, DDRCTRL_HWLPCTL_HW_LP_EN);

  /* Configure Automatic LP modes of uMCTL2 */
  MODIFY_REG(DDRCTRL->PWRTMG, DDRCTRL_PWRTMG_SELFREF_TO_X32_Msk,
             DDRCTRL_PWRTMG_SELFREF_TO_X32_0);

  ret = unset_qd3_update_conditions();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /**
    * Enable Clock disable with LP modes
    * (used in RUN mode for LPDDR2 with specific timing).
    */
  SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE);

  /* Enable automatic Self-Refresh for ASR mode */
  SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_EN);

  return ret;
}

static HAL_StatusTypeDef ddr_sr_mode_hsr(void)
{
  HAL_StatusTypeDef ret;

  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC1LPEN);
#ifdef DDR_DUAL_AXI_PORT
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC2LPEN);
#endif /* DDR_DUAL_AXI_PORT */
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRPHYCLPEN);
  MODIFY_REG(RCC->DDRITFCR, RCC_DDRITFCR_DDRCKMOD_Msk,
             RCC_DDRITFCR_DDRCKMOD_HSR1);

  /**
    * manage quasi-dynamic registers modification
    * hwlpctl.hw_lp_en : Group 3
    * pwrtmg.selfref_to_x32 & powerdown_to_x32 : Group 4
    * Group 3 is the most restrictive, apply its conditions for all
    */
  if (set_qd3_update_conditions() != 0)
  {
    return HAL_ERROR;
  }

  /* Enable HW LP interface of uMCTL2 */
  SET_BIT(DDRCTRL->HWLPCTL, DDRCTRL_HWLPCTL_HW_LP_EN);

  /* Configure Automatic LP modes of uMCTL2 */
  MODIFY_REG(DDRCTRL->PWRTMG, DDRCTRL_PWRTMG_SELFREF_TO_X32_Msk,
             DDRCTRL_PWRTMG_SELFREF_TO_X32_0);

  ret = unset_qd3_update_conditions();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /**
    * Enable Clock disable with LP modes
    * (used in RUN mode for LPDDR2 with specific timing).
    */
  SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE);

  return ret;
}

static HAL_DDR_SelfRefreshModeTypeDef ddr_sr_read_mode(void)
{
  uint32_t pwrctl = READ_REG(DDRCTRL->PWRCTL);
  HAL_DDR_SelfRefreshModeTypeDef ret;

  switch (pwrctl & (DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE |
                    DDRCTRL_PWRCTL_SELFREF_EN))
  {
    case 0U:
      ret = HAL_DDR_SW_SELF_REFRESH_MODE;
      break;
    case DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE:
      ret = HAL_DDR_HW_SELF_REFRESH_MODE;
      break;
    case DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE | DDRCTRL_PWRCTL_SELFREF_EN:
      ret = HAL_DDR_AUTO_SELF_REFRESH_MODE;
      break;
    default:
      ret = HAL_DDR_INVALID_MODE;
      break;
  }

  return ret;
}

/**
  * @}
  */

/* Exported functions ---------------------------------------------------------*/

/** @defgroup DDR_Exported_Functions DDR Exported Functions
  * @{
  */


/**
  * @brief  DDR init sequence, including
  *         - reset/clock/power management (i.e. access to other IPs),
  *         - DDRCTRL and DDRPHY configuration and initialization,
  *         - self-refresh mode setup,
  *         - data/addr tests execution after training.
  * @param  iddr DDR initialisation structure
  * @retval None.
  */
HAL_StatusTypeDef HAL_DDR_Init(DDR_InitTypeDef *iddr)
{
  HAL_StatusTypeDef ret;
  int32_t iret;
  uint32_t ddr_reten;
  uint32_t pir;
  uint32_t uret;
  uint32_t time;
  uint32_t bus_width;

  iddr->self_refresh = false;

  if (iddr->wakeup_from_standby)
  {
    iddr->self_refresh = true;
  }

  /* Disable axidcg clock gating during init */
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);

  switch (static_ddr_config.c_reg.MSTR & DDRCTRL_MSTR_DATA_BUS_WIDTH)
  {
    case DDRCTRL_MSTR_DATA_BUS_WIDTH_QUARTER:
      bus_width = 8U;
      break;
    case DDRCTRL_MSTR_DATA_BUS_WIDTH_HALF:
      bus_width = 16U;
      break;
    default:
      bus_width = 32U;
      break;
  }


  if ((static_ddr_config.c_reg.MSTR & DDRCTRL_MSTR_DDR3) != 0U)
  {
    iret = HAL_DDR_MspInit(STM32MP_DDR3);
  }
  else if ((static_ddr_config.c_reg.MSTR & DDRCTRL_MSTR_LPDDR2) != 0U)
  {
    if (bus_width == 32U)
    {
      iret = HAL_DDR_MspInit(STM32MP_LPDDR2_32);
    }
    else
    {
      iret = HAL_DDR_MspInit(STM32MP_LPDDR2_16);
    }
  }
  else if ((static_ddr_config.c_reg.MSTR & DDRCTRL_MSTR_LPDDR3) != 0U)
  {
    if (bus_width == 32U)
    {
      iret = HAL_DDR_MspInit(STM32MP_LPDDR3_32);
    }
    else
    {
      iret = HAL_DDR_MspInit(STM32MP_LPDDR3_16);
    }
  }
  else
  {
    /*  Unsupported DDR type */
    return HAL_ERROR;
  }

  if (iret != 0)
  {
    return HAL_ERROR;
  }

  /* Check DDR PHY pads retention */
  ddr_reten = READ_REG(PWR->CR3) & PWR_CR3_DDRRETEN;
  if (iddr->self_refresh)
  {
    if (ddr_reten == 0U)
    {
      iddr->self_refresh = false;
    }
  }
  else
  {
    if (ddr_reten != 0U)
    {
      SET_BIT(PWR->CR3, PWR_CR3_DDRSRDIS);
      CLEAR_BIT(PWR->CR3, PWR_CR3_DDRRETEN);
    }
  }

  /* DDR INIT SEQUENCE */

  /*
   * 1. Program the DWC_ddr_umctl2 registers
   *     nota: check DFIMISC.dfi_init_complete = 0
   */

  /* 1.1 RESETS: presetn, core_ddrc_rstn, aresetn */
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCAPBRST);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCAXIRST);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCORERST);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DPHYAPBRST);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DPHYRST);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DPHYCTLRST);

  /* 1.2. start CLOCK */
  if (ddr_clk_enable(static_ddr_config.info.speed) != 0)
  {
    return HAL_ERROR;
  }

  /* 1.3. deassert reset */
  /* De-assert PHY rstn and ctl_rstn via DPHYRST and DPHYCTLRST. */
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DPHYRST);
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DPHYCTLRST);
  /*
   * De-assert presetn once the clocks are active
   * and stable via DDRCAPBRST bit.
   */
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCAPBRST);

  /* 1.4. wait 128 cycles to permit initialization of end logic */
  /* For PCLK = 133MHz => 1 us is enough, 2 to allow lower frequency */
  ddr_delay_us(DDR_DELAY_END_LOGIC_INIT_US);

  /* 1.5. initialize registers ddr_umctl2 */
  /* Stop uMCTL2 before PHY is ready */
  CLEAR_BIT(DDRCTRL->DFIMISC, DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);

  ret = set_reg(REG_REG, (uint32_t)&static_ddr_config.c_reg);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* DDR3 = don't set DLLOFF for init mode */
  if ((static_ddr_config.c_reg.MSTR
       & (DDRCTRL_MSTR_DDR3 | DDRCTRL_MSTR_DLL_OFF_MODE))
      == (DDRCTRL_MSTR_DDR3 | DDRCTRL_MSTR_DLL_OFF_MODE))
  {
    CLEAR_BIT(DDRCTRL->MSTR, DDRCTRL_MSTR_DLL_OFF_MODE);
  }

  ret = set_reg(REG_TIMING, (uint32_t)&static_ddr_config.c_timing);
  if (ret != HAL_OK)
  {
    return ret;
  }
  ret = set_reg(REG_MAP, (uint32_t)&static_ddr_config.c_map);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* Keep the controller in self-refresh mode */
  if (iddr->self_refresh)
  {
    SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_SW);
  }

  /* Skip CTRL init, SDRAM init is done by PHY PUBL */
  MODIFY_REG(DDRCTRL->INIT0, DDRCTRL_INIT0_SKIP_DRAM_INIT_Msk,
             DDRCTRL_INIT0_SKIP_DRAM_INIT_NORMAL);

