zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_ddr.c
  ret = set_reg(REG_PERF, (uint32_t)&static_ddr_config.c_perf);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*  2. deassert reset signal core_ddrc_rstn, aresetn and presetn */
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCORERST);
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCAXIRST);
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DPHYAPBRST);

  /*
   * 3. start PHY init by accessing relevant PUBL registers
   *    (DXGCR, DCR, PTR*, MR*, DTPR*)
   */
  ret = set_reg(REGPHY_REG, (uint32_t)&static_ddr_config.p_reg);
  if (ret != HAL_OK)
  {
    return ret;
  }
  ret = set_reg(REGPHY_TIMING, (uint32_t)&static_ddr_config.p_timing);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* DDR3 = don't set DLLOFF for init mode */
  if ((static_ddr_config.c_reg.MSTR
       & (DDRCTRL_MSTR_DDR3 | DDRCTRL_MSTR_DLL_OFF_MODE))
      == (DDRCTRL_MSTR_DDR3 | DDRCTRL_MSTR_DLL_OFF_MODE))
  {
    CLEAR_BIT(DDRPHYC->MR1, DDRPHYC_MR1_DE);
  }

  /*
   *  4. Monitor PHY init status by polling PUBL register PGSR.IDONE
   *     Perform DDR PHY DRAM initialization and Gate Training Evaluation
   */
  ret = ddrphy_idone_wait();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   *  5. Indicate to PUBL that controller performs SDRAM initialization
   *     by setting PIR.INIT and PIR CTLDINIT and pool PGSR.IDONE
   *     DRAM init is done by PHY, init0.skip_dram.init = 1
   */

  pir = DDRPHYC_PIR_DLLSRST | DDRPHYC_PIR_DLLLOCK | DDRPHYC_PIR_ZCAL
        | DDRPHYC_PIR_ITMSRST | DDRPHYC_PIR_DRAMINIT | DDRPHYC_PIR_ICPC;

  if ((static_ddr_config.c_reg.MSTR & DDRCTRL_MSTR_DDR3) != 0U)
  {
    pir |= DDRPHYC_PIR_DRAMRST; /* Only for DDR3 */
  }


  /* Treat self-refresh exit : hot boot */
  if (iddr->self_refresh)
  {
    /* DDR in self refresh mode, remove zcal & reset & init */
    pir &= ~(DDRPHYC_PIR_ZCAL & DDRPHYC_PIR_DRAMRST
             & DDRPHYC_PIR_DRAMINIT);
    pir |= DDRPHYC_PIR_ZCALBYP;
  }

  ret = HAL_DDR_PHY_Init(pir);
  if (ret != HAL_OK)
  {
    return ret;
  }

  if (iddr->self_refresh)
  {
    ret = self_refresh_zcal(iddr->zdata);
    if (ret != HAL_OK)
    {
      return ret;
    }
  }

  /*
   *  6. SET DFIMISC.dfi_init_complete_en to 1
   *  Enable quasi-dynamic register programming.
   */
  start_sw_done();

  SET_BIT(DDRCTRL->DFIMISC, DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);

  ret = wait_sw_done_ack();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   *  7. Wait for DWC_ddr_umctl2 to move to normal operation mode
   *     by monitoring STAT.operating_mode signal
  */

  /* Wait uMCTL2 ready */

  /* Trigger self-refresh exit */
  if (iddr->self_refresh)
  {
    CLEAR_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_SW);
  }

  ret = wait_operating_mode(DDRCTRL_STAT_OPERATING_MODE_NORMAL);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* Switch to DLL OFF mode */
  if ((static_ddr_config.c_reg.MSTR & DDRCTRL_MSTR_DLL_OFF_MODE) != 0U)
  {
    ret = ddr3_dll_off();
    if (ret != HAL_OK)
    {
      return ret;
    }
  }


  /* DDR DQS training done */

  time = get_timer(0U);

  /*
   *  8. Disable Auto refresh and power down by setting
   *    - RFSHCTL3.dis_au_refresh = 1
   *    - PWRCTL.powerdown_en = 0
   *    - DFIMISC.dfiinit_complete_en = 0
   */
  ret = HAL_DDR_Refresh_Disable();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   *  9. Program PUBL PGCR to enable refresh during training
   *     and rank to train
   *     not done => keep the programmed value in PGCR
   */

  /*
   * 10. configure PUBL PIR register to specify which training
   *     step to run
   *     RVTRN is executed only on LPDDR2/LPDDR3
   */
  pir = DDRPHYC_PIR_QSTRN;
  if ((static_ddr_config.c_reg.MSTR & DDRCTRL_MSTR_DDR3) == 0U)
  {
    pir |= DDRPHYC_PIR_RVTRN;
  }

  ret = HAL_DDR_PHY_Init(pir);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* 11. monitor PUB PGSR.IDONE to poll cpmpletion of training
   *     sequence
   */
  ret = ddrphy_idone_wait();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* Refresh compensation: forcing refresh command */
  if (iddr->self_refresh)
  {
    ret = refresh_compensation(time);
    if (ret != HAL_OK)
    {
      return ret;
    }
  }

  /*
   * 12. set back registers in step 8 to the original values
   *     if desidered
   */
  ret = HAL_DDR_Refresh_Restore(static_ddr_config.c_reg.RFSHCTL3,
                                static_ddr_config.c_reg.PWRCTL);
  if (ret != HAL_OK)
  {
    return ret;
  }


  enable_axi_port();

  /* Enable axidcg clock gating */
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);

  /* check if DDR content is lost (self-refresh aborted) */
  if ((iddr->wakeup_from_standby) && !iddr->self_refresh)
  {
    iddr->clear_bkp = true;
  }

#ifndef DCACHE_OFF
  __set_SCTLR(__get_SCTLR() & ~SCTLR_C_BIT);
#endif /* DCACHE_OFF */

  if (iddr->self_refresh)
  {
    uret = ddr_test_rw_access();
    if (uret != 0U)
    {
      return HAL_ERROR;
    }

    /* Restore area overwritten by training */
    if (!restore_ddr_training_area())
    {
      return HAL_ERROR;
    }
  }
  else
  {
    uret = ddr_test_data_bus();
    if (uret != 0U)
    {
      return HAL_ERROR;
    }

    uret = ddr_test_addr_bus();
    if (uret != 0U)
    {
      return HAL_ERROR;
    }

    uret = ddr_check_size();
    if (uret < static_ddr_config.info.size)
    {
      return HAL_ERROR;
    }
  }

  /* Switch to Self-Refresh mode defined by the settings */
  if (HAL_DDR_SR_SetMode(ddr_sr_read_mode()) != HAL_OK)
  {
    /* Unable to switch to the predefined self-refresh mode */
    return HAL_ERROR;
  }

#ifndef DCACHE_OFF
  __set_SCTLR(__get_SCTLR() | SCTLR_C_BIT);
#endif /* DCACHE_OFF */

  return ret;
}

/**
  * @brief  Enable DDR Self-Refresh, in low power cases (when entering in CSTOP
  *         or before shutting down).
  * @param  zq0cr0_zdata IO calibration value.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DDR_SR_Entry(uint32_t *zq0cr0_zdata)
{
  /* Save IOs calibration values */
  if (zq0cr0_zdata != NULL)
  {
    *zq0cr0_zdata = READ_REG(DDRPHYC->ZQ0CR0) & DDRPHYC_ZQ0CR0_ZDATA_Msk;
  }

  /* Put DDR in Self-Refresh */
  if (ddr_sw_self_refresh_in() != 0)
  {
    return HAL_ERROR;
  }

