zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_ddr.c
  /* Enable I/O retention mode in standby */
  SET_BIT(PWR->CR3, PWR_CR3_DDRSREN);

  return HAL_OK;
}

/**
  * @brief  Remove DDR Self-Refresh on low power cases (when exiting from
  *         CSTOP).
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DDR_SR_Exit(void)
{
  HAL_StatusTypeDef ret;
  __IO uint32_t timeout;

  /* Enable all clocks */
  ddr_enable_clock();

  /*
   * manage quasi-dynamic registers modification
   * dfimisc.dfi_init_complete_en : Group 3
   */
  if (set_qd3_update_conditions() != 0)
  {
    return HAL_ERROR;
  }

  /* Mask dfi_init_complete_en */
  CLEAR_BIT(DDRCTRL->DFIMISC, DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);

  ret = unset_qd3_update_conditions();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* Switch controller clocks (uMCTL2/PUBL) to DLL ref clock */
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_GSKPCTRL);

  /* Enable all DLLs: GLITCH window */
  CLEAR_BIT(DDRPHYC->ACDLLCR, DDRPHYC_ACDLLCR_DLLDIS);
  CLEAR_BIT(DDRPHYC->DX0DLLCR, DDRPHYC_DX0DLLCR_DLLDIS);
  CLEAR_BIT(DDRPHYC->DX1DLLCR, DDRPHYC_DX1DLLCR_DLLDIS);
#ifdef DDR_32BIT_INTERFACE
  CLEAR_BIT(DDRPHYC->DX2DLLCR, DDRPHYC_DX2DLLCR_DLLDIS);
  CLEAR_BIT(DDRPHYC->DX3DLLCR, DDRPHYC_DX3DLLCR_DLLDIS);
#endif /* DDR_32BIT_INTERFACE */

  /* Additional delay to avoid early DLL clock switch */
  ddr_delay_us(DDR_DELAY_10_US);

  /* Switch controller clocks (uMCTL2/PUBL) to DLL ref clock */
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_GSKPCTRL);

  CLEAR_BIT(DDRPHYC->ACDLLCR, DDRPHYC_ACDLLCR_DLLSRST);

  ddr_delay_us(DDR_DELAY_10_US);

  SET_BIT(DDRPHYC->ACDLLCR, DDRPHYC_ACDLLCR_DLLSRST);

  /* PHY partial init: (DLL lock and ITM reset) */
  WRITE_REG(DDRPHYC->PIR, DDRPHYC_PIR_DLLSRST | DDRPHYC_PIR_DLLLOCK
                        | DDRPHYC_PIR_ITMSRST | DDRPHYC_PIR_INIT);

  /* Need to wait at least 10 clock cycles before accessing PGSR */
  ddr_delay_us(DDR_DELAY_1_US);

  /* Pool end of init */
  timeout = ddr_timeout_init_us(DDR_TIMEOUT_500_US);

  while ((READ_REG(DDRPHYC->PGSR) & DDRPHYC_PGSR_IDONE) == 0U)
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT;
    }
  }

  /*
   * manage quasi-dynamic registers modification
   * dfimisc.dfi_init_complete_en : Group 3
   */
  if (set_qd3_update_conditions() != 0)
  {
    return HAL_ERROR;
  }

  /* Unmask dfi_init_complete_en to uMCTL2 */
  SET_BIT(DDRCTRL->DFIMISC, DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);

  ret = unset_qd3_update_conditions();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* Deactivate sw retention in PWR */
  CLEAR_BIT(PWR->CR3, PWR_CR3_DDRRETEN);

  /* Enable PZQ cell (PUBL register) */
  CLEAR_BIT(DDRPHYC->ZQ0CR0, DDRPHYC_ZQ0CR0_ZQPD);

  /* Enable pad drivers */
  CLEAR_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_ACPDD);

  /* Enable command/address output driver */
  SET_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_ACOE);
  CLEAR_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_CKPDD_Msk);
  CLEAR_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_CSPDD_Msk);
  CLEAR_BIT(DDRPHYC->DXCCR, DDRPHYC_DXCCR_DXPDD);
  CLEAR_BIT(DDRPHYC->DXCCR, DDRPHYC_DXCCR_DXPDR);

  /* Release latch */
  SET_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_CKOE);
  CLEAR_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_ODTPDD_Msk);
  CLEAR_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_NL2PD);
  CLEAR_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_CKEPDD_Msk);

  /* Remove selfrefresh */
  sw_selfref_exit();

  /* Wait operating_mode == normal */
  timeout = ddr_timeout_init_us(DDR_TIMEOUT_500_US);

  while ((READ_REG(DDRCTRL->STAT) & DDRCTRL_STAT_OPERATING_MODE_Msk)
         != DDRCTRL_STAT_OPERATING_MODE_NORMAL)
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT;
    }
  }

  /* AXI ports are no longer blocked from taking transactions */
  enable_axi_port();
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);

  return ret;
}

/**
  * @brief  Activate either HW, or SW or automatic self-refresh, in low power
  *         cases (when entering in or exiting from CSTOP).
  * @param  mode Self-refresh mode.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DDR_SR_SetMode(HAL_DDR_SelfRefreshModeTypeDef mode)
{
  HAL_StatusTypeDef ret;

  switch (mode)
  {
    case HAL_DDR_SW_SELF_REFRESH_MODE:
      ret = ddr_sr_mode_ssr();
      break;
    case HAL_DDR_AUTO_SELF_REFRESH_MODE:
      ret = ddr_sr_mode_asr();
      break;
    case HAL_DDR_HW_SELF_REFRESH_MODE:
      ret = ddr_sr_mode_hsr();
      break;
    default:
      ret = HAL_ERROR;
      break;
  }

  return ret;
}

/**
  * @brief  Read current self-refresh mode, in low power
  *         cases (when entering in or exiting from CSTOP).
  * @retval Self-refresh mode.
  */
HAL_DDR_SelfRefreshModeTypeDef HAL_DDR_SR_ReadMode(void)
{
  return ddr_sr_read_mode();
}

/**
  * @}
  */
#endif /* DDRCTRL & DDRPHYC */
#endif /* HAL_DDR_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
